<template>
	<div class="messagefour">
		<div class="messageonediv">
			<div @click="movestwo" class="messageonediv_divone" :class="{messageonediv_div:moves==2}">注册协议</div>
			<div @click="movesone" class="messageonediv_divone" :class="{messageonediv_div:moves==1}">出借人协议</div>			
			<div @click="movesthree" class="messageonediv_divone" :class="{messageonediv_div:moves==3}">借款人协议</div>
		</div>
		
		<div class="messageonebox" v-show="moves==1">
			
			
			<div  class="messageonetitle">出借人服务协议</div>
			<div class="messagetitlbox">借款须知：</div>

			<div class="messagetents">
				1.本协议中所称“全民金服”是指由广西全民贷互联网金融信息咨询服务有限公司注册并负责运营，为注册用户提供包括但不限于线上交易、信息传递、披露与撮合等相关服务的互联网信息服务平台，包括网址为www.qmjf123.com网站（全民金服）、“全民金服”移动终端APP及后续可能开发的其他平台或软件，以下所称“全民金服”或“本平台/平台”即包含了全民金服平台、广西全民贷互联网金融信息咨询服务有限公司。本协议所指的“用户”是指依据本协议以及《注册服务协议》在全民金服平台注册的具有合法的闲散资金出借给借款人的个体，个体包含自然人、法人及其他组织（以下统称“出借人”或“您”）。本协议在出借人和全民金服之间具有法律效力。 
			</div>
			
			<div class="messagetitlbox">一、 释义</div>
			<div class="messagetents">
				在本协议中，除非上下文另有解释，下列词语具有以下含义:
			</div>
			<div class="messagetents">
				1.1出借人：本协议所指出借人是指在全民金服注册成为平台用户，具有合法的闲散资金，同意根据自身投资风险意识、风险识别能力将一定数量资金出借给借款人的个体。个体包含自然人、法人及其他组织。
			</div>
			<div class="messagetents">
				1.2借款人：本协议所指借款人指有一定的借款需求并在全民金服注册成为平台会员，经全民金服推荐与出借人建立借贷关系并得到一定数量出借资金的自然人和法人。
			</div>
			<div class="messagetents">
				1.3 借款标的：借款人在全民金服发布的包含借款金额、借款利率、借款期限等信息的不可撤销的借款要约。
			</div>
			<div class="messagetents">
				1.4投标：出借人向借款人发布的借款标的表明出借资金的承诺。
			</div>
			<div class="messagetents">
				1.5 满标：借款人发布的借款标的，在规定的期限内借款金额被出借人全部承诺出借的状态。
			</div>
			<div class="messagetents">
				1.6平台电子账户：借款人/出借人在全民金服注册后所持有的以电子形式存在专属于借款人/出借人个人的具有个人身份识别、个人信息管理、资金充值、资金管理等功能的网络电子账户。
			</div>
			<div class="messagetitlbox">二、资金充值</div>
			<div class="messagetents">
				2.1出借人可以使用全民金服规定的方式向其开设在全民金服的平台电子账户，进行资金充值，并用于向全民金服发布的借款标的进行资金出借。出借人向全民金服进行充值的行为是其自愿行为、且为本人操作。
			</div>
			<div class="messagetents">
				2.2为了严格控制风险、保障出借人利益，出借人在出借过程中，如果暂时没有合适的借款标的出现，出借人充值的资金余额（如有）将保留在出借人的平台电子账户里。在此期间出借人资金不获得出借收益以及银行存款利息在内的任何收益，出借人对此无异议。出借人可登录全民金服查询尚未匹配出借的资金情况。
			</div>
			<div class="messagetitlbox">三、投标</div>
			<div class="messagetents">
				3.1 出借人可以自行投标，也可以根据自身的风险偏好和投资习惯设置投标条件后使用全民金服提供的自动投标类工具、计划等进行自动投标（下称“自动投标”）。
			</div>
			<div class="messagetents">
				3.2出借人承诺，无论是自行投标还是自动投标，出借人的投标行为均视为承诺向发布对应借款标的借款人提供借款。该出借人投标后，无权撤销投标行为或者要求减少投标资金。
			</div>
			<div class="messagetents">
				3.3出借人投标后至满标前，投标资金将被冻结，出借人不得将投标资金撤回。冻结期间出借人资金不获得出借收益以及银行存款利息在内的任何收益，出借人对此无异议。
			</div>
			<div class="messagetents">
				3.4同时全民金服不保证出借人的投标一定与某一借款标的匹配，若借款人发布的借款标的因借款人原因或其他不可抗力导致流标的，则解冻投标资金，并将出借人投标资金划转回出借人平台电子账户。
			</div>
			<div class="messagetents">
			3.5出借人投标行为在法律上视为不可撤销的承诺。一旦借款人发布的借款标的与出借人投标资金匹配，则出借人承诺出借投标资金。
			</div>
			<div class="messagetents">
				3.6单个借款标的可能由多个出借人进行投标，单个出借人仅是该借款人的债权人之一。
			</div>
		
			<div class="messagetitlbox">四、借款关系的确立</div>
			<div class="messagetents">
			4.1当借款人发布的借款标的在有效期限内满标且经全民金服审核通过后，视为投标成功。投标成功后，由全民金服合作的第三方支付机构将投标资金划付至借款人的平台电子账户，完成此次出借。在此，出借人知悉并授权全民金服合作的第三方支付机构（以下简称“第三方支付机构”）代其进行划转出借资金、划转出借相关费用、发放还款款项等资金划转和划扣业务的操作。
			</div>
			<div class="messagetents">
				4.2出借人同意与发布借款标的的借款人签订《借款合同》。《借款合同》以电子合同的形式展现和签署，签署之日，为《借款合同》成立之日，出借资金划付至借款人平台电子账户之日，为出借人与借款人借贷关系生效之日。
			</div>
			<div class="messagetents">
				4.3出借人同意委托并授权全民金服依据平台公布的各项规则及相关协议、条款与声明、对借款所涉及的各类电子合同和纸质合同实施保存、管理。
			</div>
			<div class="messagetitlbox">五、借款偿还</div>
			<div class="messagetents">
				5.1出借人知悉及同意，就您资金项下所匹配的借款人，可能存在多位出借人与您共同出借资金给该借款人，以实现借款人的借款需求，在此情形下，第三方支付机构将于每期还款日将借款人的还款按出借资金的比例代为划付至出借人的平台电子账户，完成本协议项下部分或全部还款。
			</div>
			<div class="messagetents">
				5.2 出借人同意借款人可在约定的期限届满前提前还款，借款人提前还款无需出借人事先同意，亦不视为借款人违约，该借款人应支付的利息按照签订的《借款合同》中约定的办法结算。借款人提前还款可能会影响出借人的资金收益期望，出借人对此知悉并无异议。
			</div>
			
			<div class="messagetitlbox">六、逾期还款</div>
			<div class="messagetents">
				6.1 在借款人逾期还款的情况下，出借人授权全民金服或/及其他第三方采取包括但不限于如下方式对债权进行追索：宣布借款人未偿本息全部到期、向借款人进行借款的违约提醒及催收工作（包括但不限于电话通知、上门通知、发律师函、对借款人提起诉讼、处置借款人提供的担保物等）、委托专业的催收公司或自行催收、将借款人逾期情况在平台进行披露等。全民金服有权决定以上债权追索相关的事宜，包括选定委托催收公司和决定合理催收费用等。
			</div>
			<div class="messagetents">
				6.2 如有第三方（非借款人、非本平台，以下称“代偿人）自愿代为偿还借款人的相应应还款项的，自代偿人代借款人代偿后，代偿人有权行使本协议规定的出借人之权利向借款人追偿。出借人对此代偿行为完全知晓并予以同意，并受其约束。
			</div>
			<div class="messagetents">
				6.3法律法规、《借款合同》及有关协议约定的其他责任。
			</div>
			<div class="messagetents">
				6.4对因出借人、出借人授权委托全民金服或其他第三方执行的追索债权的行为给借款人造成的损失，全民金服不承担任何法律责任。
			</div>
		
			<div class="messagetitlbox">七、出借人的权利义务</div>
			<div class="messagetents">
			7.1出借人保证其向全民金服提供的信息和资料均为合法、真实、有效。
			</div>
			<div class="messagetents">
				7.2出借人承诺：其所用于出借的资金来源合法，出借人是该资金的合法所有人，该等资金并非任何非法活动所得，也非汇集或归集他人之资金。如果第三人对资金归属、合法性问题发生争议，由出借人负责解决并自行承担相关责任。
			</div>
			<div class="messagetents">
				7.3对于全民金服推荐展示而获取的借款人的个人信息及其他与借款人相关的信息，出借人确保仅用于出借参考，不向全民金服以外的其他任何一方披露、出售或共同使用该等信息，出借人有义务为借款人的全部信息及全民金服的业务内容进行保密。如果出借人擅自，或不恰当地向他人披露、出售或共同使用借款人的全部或部分信息或全民金服的商业秘密，导致对借款人、全民金服造成损失，则由出借人承担该损失的全部赔偿责任。
			</div>
		
			<div class="messagetitlbox">八、平台的权利义务</div>
			<div class="messagetents">
				8.1全民金服应当按照本协议的规定，为出借人进行网络借贷信息推荐及账户相关管理服务，为出借人寻找并推荐借款人，并按照本协议约定完成出借人委托事项。
			</div>
			<div class="messagetents">
			8.2全民金服保留核实出借人提供信息的准确性的权利。全民金服有权在任何时候依据自己的判断决定是否终止向出借人提供服务并取消其用户资格。
			</div>
			<div class="messagetents">
				8.3全民金服有义务（包括通过其他的合作方）对借款人的资信进行预测、筛选。在借款标的满标之前，如果全民金服有合理怀疑借款标的包含不正确信息（包括但不限于无意的错误，借款人收入、信用状况变化等等），可能违反任何法律法规规定或违反任何全民金服的规则，全民金服有权终止该借款标的以及取消已经完成的投标，并不作任何解释。借款标的被终止导致流标的，出借人投标该借款标的资金将会返还至其平台电子账户。
			</div>
			<div class="messagetents">
				8.4全民金服为网络借贷中介服务平台，全民金服在任何情况下均不会成为出借人和借款人借贷关系的担保人，亦不会以其自有资金承担任何担保责任。
			</div>
			<div class="messagetitlbox">九、风险提示及免责声明</div>
			<div class="messagetitlboxli">9.1 风险提示</div>
			<div class="messagetents">
				出借人需充分了解通过全民金服进行交易的风险，出借人应对自己的资金状况、交易期限、收益预期、风险承受能力和风险偏好做出客观合理的评估后，再做出是否进行交易的决定，一旦出借人在全民金服进行交易，即视为出借人对在全民金服进行交易的风险有合理预期及承受能力，自行承担借贷产生的本息损失，全民金服不能也没有义务为任何交易前后的风险承担责任。
			</div>
			<div class="messagetitlboxli">9.2免责声明</div>
			<div class="messagetents">
				全民金服不对任何用户及任何交易提供任何明示或默示的担保。交易平台向用户提供的各种信息及资料仅为参考，用户应依其独立判断做出决策。用户据此进行交易的，产生的风险由用户自行承担，用户无权据此向全民金服提出任何法律主张。在交易过程中，交易各方发生的纠纷，由纠纷各方自行解决。
			</div>
			<div class="messagetitlbox">十、法律适用与争议解决</div>
			<div class="messagetents">
				10.1本协议之效力、解释、变更、履行与争议解决均适用中华人民共和国法律。
			</div>
			<div class="messagetents">
				10.2因本协议产生之任何争议，由当事人友好协商解决；协商不成的，任何一方均有权向全民金服注册地人民法院提起诉讼。
			</div>

			<div class="messagetitlbox">十 一、其他</div>
			<div class="messagetents">
				11.1本协议经借款人通过全民金服以在线点击确认或点击相关按钮的方式订立并生效，以借款人账户在全民金服通过点击确认或类似方式签署本电子协议即视为借款人本人操作且系借款人本人真实意愿签署本协议，亦将被视为本协议的签署行为。本协议自生效之日起，除非全民金服终止本协议或者出借人丧失本平台用户资格，否则本协议始终有效。本协议终止并不免除借款人根据本协议或其他有关协议、规则所应承担的义务和责任。
			</div>
			<div class="messagetents">
				11.2全民金服有权对本协议、《注册服务协议》、《借款合同》、《出借人服务协议》及其他全民金服的各类规则进行修改，经修改的协议、规则一经在全民金服公布后，立即自动生效。
			</div>
			<div class="messagetents">
				11.3若本协议的部分条款被认定为无效或者无法实施时，本协议中的其他条款仍然有效并应继续予以履行。
			</div>
		</div>
		<div class="messageonebox" v-show="moves==2">
			<div  class="messageonetitle">注册服务协议</div>
			<div class="messagetitlbox">注册须知：</div>
			<div class="messagetents">
				1、本协议中所称“全民金服”是指由广西全民贷互联网金融信息咨询服务有限公司注册并负责运营的，为注册用户提供包括但不限于线上交易、信息传递、披露与撮合等相关服务的互联网借贷交易服务平台，包括网址为www.qmjf123.com网站（全民金服）、“全民金服”移动终端APP及后续可能开发的其他平台或软件(以下所称“全民金服”或“本平台/平台”即包含了全民金服平台、广西全民贷互联网金融信息咨询服务有限公司)。本协议所指的“用户”是指依据本协议在全民金服注册的个人和企业客户，以下统称“用户”或“您”。本协议在用户和全民金服之间具有法律效力。
			</div>
			<div class="messagetents">
				2、用户按照全民金服注册程序和注册要求完成注册即表示用户完全知悉理解并接受本协议项下的全部条款。全民金服在此特别提醒您务必审慎阅读、充分理解本协议各条款内容。除非您已阅读并接受本协议所有条款，否则您无权注册和使用本平台的相关服务。
			</div>
			<div class="messagetents">
				3、全民金服只接受中华人民共和国具有完全民事行为能力的自然人，或者是依法成立、具有合法经营资格并有效存续的实体组织。如您不符合资格，请勿注册。全民金服保留中止或终止用户身份的权利。
			</div>
			<div class="messagetents">
				4、您注册成功后，全民金服通过您的注册用户名及密码来识别用户的指令。用户在此确认，以其帐号和密码登录全民金服及相关交易网站情形下，经由用户的全民金服账户发出的一切指令均视为用户本人的行为和真实意思表示，该等指令不可撤销，由此产生的一切责任和后果由用户本人承担。用户不得将其帐号、密码转让或出借于他人使用。如用户发现其帐号遭他人非法使用或存在安全漏洞的情况，应立即通知全民金服。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，全民金服不承担任何责任。
			</div>
			<div class="messagetents">
				5、在本平台交易需订立的协议或合同均采用电子合同方式。您使用账户及密码登录本平台后，根据本平台的相关规则，以自身账户在本平台通过点击确认或类似方式签署的电子合同即视为您本人真实意愿签署的合同，具有法律效力。您应妥善保管自己的账户名称、密码等信息。您通过前述方式订立的电子合同对合同各方均具有法律约束力，您不得以账户密码等账户信息被盗用或其他理由否认已订立合同的效力或不按照合同履行相关义务。您委托全民金服保管所有与本协议有关的书面文件或电子信息，您确认并同意由全民金服提供的与本协议有关的书面文件或电子信息在无明显错误的情况下应作为本协议有关事项的终局证明。
			</div>
			<div class="messagetents">
				6、本平台有权根据需要不时地制定、修改本协议或各类规则。本协议以及规则如有任何变更,本平台将在平台上刊载公告,经修订的协议、规则一经在本平台公布后,立即自动生效。您应不时地注意本协议及附属规则的变更。若您不同意相关变更,请立即停止登录本平台及/或停止使用本平台的服务。用户继续登录本平台及/或继续使用本平台的服务，即视为已同意并接受协议及规则的修订和变更。
			</div>
			<div class="messagetitlbox">一、服务的提供</div>
			<div class="messagetents">
				1.1全民金服为网络借贷信息中介服务平台。本平台的服务内容包括但不限于：交易机会查阅、交易需求发布、资金充值/提现、签订合同、交易记录查阅、合同管理、交易管理、会员信息更新、密码重置以及参加平台的有关活动等，具体详情以本平台当时提供的服务内容为准。
			</div>
			<div class="messagetents">
				1.2全民金服仅对发布的信息承担表面审查责任，不对信息的准确、完整、合法性做出保证，也不承担相关责任。您通过全民金服进行的任何交易，均视为经过您本人审慎抉择、独立判断之后作出的决策，由此产生的任何风险由您自行承担。您与交易对方之间因交易发生的任何纠纷，应由交易各方自行解决，全民金服不承担任何交易风险及法律责任。
			</div>
			<div class="messagetitlbox">二、服务费用</div>
			<div class="messagetents">
				2.1用户使用全民金服服务，全民金服有权向用户收取相关服务费用。服务费的具体收费方式、收费标准详见全民金服服务收费说明。
			</div>
			<div class="messagetents">
				2.2全民金服保留单方面制定及调整服务费用的权利。费用标准一旦被修改，即公布在网站上，修改后的费用标准一经公布即行生效，适用于费用标准修改后发生的交易。 
			</div>
			
			<div class="messagetitlbox">三，服务中断或终止</div>
			<div class="messagetents">
			3.1鉴于网络服务的特殊性，用户同意全民金服有权随时变更、中断或终止部分或全部的网络服务。由于系统维护、设备故障、黑客攻击及其他不可抗力的影响，而无法正常使用相关服务时，全民金服不承担任何责任。
			</div>
			<div class="messagetents">
				3.2如果发现用户违规或者违法本协议的规定的，平台有权暂停、终止或限制该用户访问直至取消该用户的会员资格，并不予任何赔偿或者退还任何已收取的服务费用。
			</div>
			<div class="messagetitlbox">四、用户权利义务</div>
			<div class="messagetents">
				4.1用户有权根据本协议的规定以及全民金服发布的相关规则，利用全民金服信息发布、查询平台服务信息、提交借款项目信息、参加全民金服的有关活动以及有权享受全民金服提供的其它的有关服务。
			</div>
			<div class="messagetents">
			4.2您应保证提交资料的合法性、真实性、准确性和完整性。
			</div>
			<div class="messagetents">
				4.3您不得利用本平台提供的服务从事任何非法行为，不得违反中国法律、法规、规章、规范性文件及政策以及本协议及附属规则的约定，不得侵犯他人的合法权益，如有违反而导致任何法律后果的发生,用户将以自己的名义独立承担所有相应的法律责任。
			</div>
			<div class="messagetitlbox">五、风险提示及免责声明</div>
			<div class="messagetitlboxli"> 5.1风险提示</div>
			
			<div class="messagetents">
			您理解并认可，任何通过本平台所进行的交易或操作行为并不能避免风险的发生，全民金服不能也没有义务为交易后产生的风险负责
			</div>
			<div class="messagetents">
				5.2全民金服不对任何用户及/或任何交易提供任何明示或默示的担保。交易平台向用户提供的各种信息及资料仅为参考，用户应依其独立判断做出决策。用户据此进行交易的，产生的风险由用户自行承担，用户无权据此向全民金服提出任何法律主张。在交易过程中，交易各方发生的纠纷，由纠纷各方自行解决。
			</div>
			<div class="messagetents">
			5.3全民金服合作机构提供的服务内容由该合作单位负责。用户享用相关服务时产生的争议、纠纷及损失，全民金服不承担任何责任。
			</div>
			<div class="messagetitlbox">六、隐私保护规则</div>
			<div class="messagetents">
				6.1全民金服对于您提供的、全民金服自行收集的、经认证的您的信息将按照本协议予以保护、使用或者披露。
			</div>
			<div class="messagetents">
				6.2全民金服将依照国家有关法律法规，采取各种严格的措施确保您的信息安全，以防止未经合法授权的任何人、任何机构，包括本平台未经授权的员工或分支机构获取您的信息。但是，鉴于技术限制，全民金服不能确保您的全部私人通讯及其他个人资料不会被泄露出去。
			</div>

			<div class="messagetents">
				6.3全民金服对于用户提供的、全民金服自行收集的以及其他个人用户信息享有使用和披露权，全民金服基于促成交易、履行协议、解决争议、保障平台交易安全等合法目的而使用其您资料的，无需告知用户。
			</div>
			<div class="messagetents">
				6.4为避免用户通过全民金服从事违规违法活动，保护全民金服及其他用户的合法权益，全民金服有权通过人工或自动程序对您的个人信息资料进行审核和评价。
			</div>
			<div class="messagetitlbox">七、知识产权保护</div>
			<div class="messagetents">
				7.1除另有特别声明外，全民金服提供的网络服务中包含的任何文本、图片、图形、音频和或视频资料均受版权、商标或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。
			</div>
			<div class="messagetents">
				7.2尊重知识产权是用户应尽的义务，如有违反，用户应对全民金服承担损害赔偿等法律责任。
			</div>
			<div class="messagetitlbox">八、通知与送达</div>
			<div class="messagetitlboxli">8.1 通知方式</div>
			<div class="messagetents">
				本协议条款及其任何其他协议、告示或其他关于用户使用本服务账户及服务的通知，用户同意本平台使用电子方式或通过向用户在注册时预留的通讯地址邮寄文件资料的方式通知用户。电子方式包括但不限于以电子邮件方式、短信息、站内信或于本平台或者合作平台上公布、或通过官方微信、APP、官方微博等方式公布。
			</div>
			<div class="messagetitlboxli">8.2 送达</div>
			<div class="messagetents">
				平台的通知如以公示方式作出的，一经在本平台公示即视为已经送达。除此之外，其他向用户个人发布的具有专属性的通知将由本平台向用户在注册时提供的电子邮箱，或本平台在用户的个人账户中的站内信，或用户在注册后在本平台绑定的手机发送，一经发送即视为已经送达。请用户密切关注用户的电子邮箱、站内信及手机中的短信信息。因信息传输等原因导致用户未在前述通知发出当日收到该等通知的，本平台不承担责任。
			</div>
			<div class="messagetitlbox">九、管辖与法律适用</div>
			<div class="messagetents">
				9.1本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。
			</div>
			<div class="messagetents">
				9.2若您和全民金服之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意向全民金服注册地的广西壮族自治区南宁市青秀区人民法院提起诉讼
			</div>
			<div class="messagetitlbox">十一、其他</div>
			<div class="messagetents">
				11.1 本协议经用户通过全民金服以在线点击确认或点击相关按钮的方式订立并生效，以用户账户在全民金服通过点击确认或类似方式签署本电子协议即视为用户本人操作且系用户本人真实意愿签署本协议，亦将被视为本协议的签署行为。本协议自生效之日起，除非全民金服终止本协议或者用户丧失本平台用户资格，否则本协议始终有效。本协议终止并不免除用户根据本协议或其他有关协议、规则所应承担的义务和责任。
			</div>
			<div class="messagetents">
				11.2在全民金服的某些部分或页面中可能存在除本协议以外的单独的附加服务条款，当这些条款存在冲突时，在这些部分和页面中附加条款优先适用。
			</div>
			<div class="messagetents">
				11.3 若本协议的部分条款被认定为无效或者无法实施时，本协议中的其他条款仍然有效。 
			</div>

		</div>
		<div class="messageonebox" v-show="moves==3">
			<div  class="messageonetitle">借款人服务协议</div>
			<div class="messagetitlbox">借款须知：</div>

			<div class="messagetents">
				1.本协议中所称“全民金服”是指由广西全民贷互联网金融信息咨询服务有限公司注册并负责运营的，为注册用户提供包括但不限于线上交易、信息传递、披露与撮合等相关服务的互联网信息服务平台，包括网址为www.qmjf123.com网站（全民金服）、“全民金服”移动终端APP及后续可能开发的其他平台或软件，以下所称“全民金服”或“本平台/平台”即包含了全民金服平台、广西全民贷互联网金融信息咨询服务有限公司。本协议所指的“用户”是指依据本协议以及《注册服务协议》在全民金服平台注册的有借款需求的自然人和法人，（以下统称“借款人”或“您”）。本协议在借款人和全民金服之间具有法律效力。
			</div>
			<div class="messagetents">
				全民金服在此特别提醒，在您选择接受本协议并注册成为全民金服借款人之前，请仔细阅读本协议并充分、完整理解本协议各条款的内容。否则，您一经注册或使用全民金服服务即视为您已经充分理解并完全接受本协议的全部条款。
			</div>
			<div class="messagetitlbox">一、 释义</div>
			<div class="messagetents">
				在本协议中，除非上下文另有解释，下列词语具有以下含义:
			</div>
			<div class="messagetents">
				1.1出借人：本协议项下之出借人指在全民金服注册成为平台会员，具有合法的闲散资金，同意根据全民金服的推荐，经过自身独立审慎的判断将一定数量资金出借给借款人的个体。个体包含自然人、法人及其他组织。
			</div>
			<div class="messagetents">
				1.2借款人：本协议所指借款人指有一定的借款需求并在全民金服注册成为平台会员，经全民金服推荐与出借人建立借贷关系并得到一定数量出借资金的自然人和法人。
			</div>
			<div class="messagetents">
				1.3 借款标的：借款人在全民金服发布的包含借款金额、借款利率、借款期限等信息的不可撤销的借款要约。
			</div>
			<div class="messagetents">
				1.4投标：出借人向借款人发布的借款标的表明出借资金的承诺。
			</div>
			<div class="messagetents">
				1.5 满标：借款人发布的借款标的，在规定的期限内借款金额被出借人全部承诺出借的状态。
			</div>
			<div class="messagetents">
				1.6会员账户：借款人/出借人在全民金服注册后所持有的以电子形式存在专属于借款人/出借人个人的具有个人身份识别、个人信息管理、资金充值、管理等功能的平台电子账户。
			</div>
			<div class="messagetitlbox">二、借款申请</div>
			<div class="messagetents">
				2.1 全民金服借款服务只接受中华人民共和国具有完全民事行为能力的自然人，或者是依法成立、具有合法经营资格并有效存续的实体组织，并且借款人能独立承担本协议项下之全部权利义务，有充分、完整、合法的权利签署并履行本协议。如您不符合资格，请勿注册并申请借款。
			</div>
			<div class="messagetents">
				2.2 全民金服保留独立依据相关法律法规及本平台的具体规定决定是否审批通过借款人在平台上发起的借款申请的权利。
			</div>
			<div class="messagetitlbox">三、借款用途</div>
			<div class="messagetents">
				3.1借款人保证其借款用途真实、明确，严格按照《借款合同》的约定使用借款。
			</div>
			<div class="messagetents">
				3.2 借款人不能将所借款项用于任何非法活动（包括但不限于赌博、吸毒、贩毒、卖淫嫖娼），否则一经发现，全民金服有权立即向公安等有关机构进行举报。
			</div>
			<div class="messagetitlbox">四、借款标的发布</div>
			<div class="messagetents">
				 4.1全民金服根据对借款人个人信用的评估和分析结果，决定对借款人提交的借款申请予以审核通过的，借款人可以在全民金服指定的区域发布借款标的，但借款人所发布的借款标的的金额及借款利率不得超过本网站及网络借贷有关监管规定的上限。
			</div>
			<div class="messagetents">
				4.2借款人的借款标的中应当包括借款金额、借款利率、借款期限、借款用途，同时借款人还应当提供其年收入、职业和就业状态、存款情况、在所有网络借贷信息中介机构未偿还借款信息、影响或者可能影响出借人权益的重大信息等信息。全民金服有权同时将借款人的信用记录中的可能影响潜在出借人判断的信息显示在借款人的借款标的中。
			</div>
			<div class="messagetents">
				4.3借款人不得随意自行修改或撤回借款标的。全民金服有权以自己的独立判断，来限制借款人发布借款标的，中止或终止借款人已发布的借款标的。
			</div>
			<div class="messagetitlbox">五、借款关系的确立</div>
			<div class="messagetents">
				5.1借款人所发布的借款标的在法律上视为不可撤销的要约。一旦借款人发布的借款标的与潜在出借人出借的资金相匹配，则借款人无条件接受该笔借款并支付应付款项（包括但不限于用于归还出借人的本金、利息、逾期利息、违约金等款项、需要向全民金服支付的服务费、贷后管理费等费用，以及出借人或全民金服为实现债权而发生的其他费用）。
			</div>
			<div class="messagetents">
				5.3借款人同意与潜在的出借人签订《借款合同》。《借款合同》以电子合同的形式展现和签署，签署之日，为《借款合同》成立之日，出借资金划付至借款人会员账户之日，为出借人与借款人借贷关系生效之日。
			</div>
			<div class="messagetents">
				5.3借款人同意委托并授权全民金服依据平台公布的各项规则及相关协议、条款与声明、对借款所涉及的各类电子合同和纸质合同实施保存、管理。
			</div>
			<div class="messagetitlbox">六、借款的发放及还款</div>
			<div class="messagetitlboxli">6.1借款的发放</div>
			<div class="messagetents">
				6.1.1只有当借款人发布的借款标的满标，并且通过全民金服的最终审核，借款人才能获得借款。借款款项划付至借款人的平台电子账户，即视为完成该借款出借。
			</div>
			<div class="messagetents">
				6.1.2 在此，借款人知悉并授权全民金服合作的第三方支付机构代其进行借款款项划转、划扣还款款项等资金划转和划扣业务的操作。
			</div>
			<div class="messagetents">
				6.1.3借款人保证其绑定的银行卡或填写的提现银行卡信息是准确和有效的，若因借款人提交的银行卡信息有误或银行卡无效致使提现失败或提现延迟的，不影响出借人完成本协议项下资金的出借，若有相应的后果由借款人自行承担，出借人及全民金服对此不承担任何责任。
			</div>
			<div class="messagetitlboxli">6.2.还款</div>
			<div class="messagetents">
				6.2.1借款人承诺根据《借款合同》的约定，按时足额向出借人还款。在借款人将还款资金存入其全民金服会员账户后，借款人同意并授权第三方支付机构将借款人的还款资金按照出借人的出借金额比例划付至出借人的全民金服会员账户，完成本协议项下部分或全部还款。借款人是否履行还款义务以全民金服网站系统显示为准。借款人按期足额存入应还款项且全民金服系统扣款成功，显示“已结清”字样或者向借款人发送短信息提示还款成功的，视为借款人履行还款义务。
			</div>
			<div class="messagetents">
				6.2.2借款人保证在还款日之前，其所指定的全民金服资金账户内有足够的还款资金；若因借款人资金账户内余额不足致使扣款失败的，由借款人自行承担相应的后果。
			</div>
			<div class="messagetents">
				6.2.3借款人有权在借款期内任一时间一次性提前偿还全部剩余借款本金并结清利息。如借款人提前清偿借款的，不视为借款人违约，全民金服承诺不收取借款人的违约金及罚息。借款人提前还款应支付的利息及其他费用按照签订的《借款合同》中约定的办法结算。
			</div>
			<div class="messagetitlbox">七、逾期还款</div>
			<div class="messagetents">
				7.1借款人在此知悉并确认，若借款人逾期还款，出借人、经出借人授权委托全民金服或/及其他第三方通过以下方式追索债权（包括但不限于如下方式）：宣布借款人未偿本息全部到期、向借款人进行借款的违约提醒及催收工作（包括但不限于电话通知、上门通知、发律师函、对借款人提起诉讼、处置借款人提供的担保物等、委托专业的催收公司或自行催收、将借款人逾期情况在平台进行披露等）。
			</div>
			<div class="messagetents">
				7.2如有第三方（非借款人、非本平台，以下称“代偿人）自愿代为偿还借款人的相应应还款项的，自代偿人代借款人代偿后，代偿人有权行使本协议规定的出借人之权利向借款人追偿。借款人对此代偿行为完全知晓并予以同意，并受其约束。
			</div>
			<div class="messagetents">
				7.3对因出借人或出借人授权委托全民金服或其他第三方执行的追索债权的行为给借款人造成的损失，全民金服不承担任何法律责任。
			</div>
			<div class="messagetitlbox">八、借款人的权利和义务</div>
			<div class="messagetents">
				8.1借款人应当按照相关借款约定提供真实、准确、完整的用户信息及融资信息，包括但不限于您的身份信息、信用信息，财产信息、在所有网络借贷信息中介机构未偿还借款信息等信息；不得提供虚假的身份、信息或资料、故意变换身份、虚构融资项目、夸大融资项目收益前景等形式的欺诈借款。
			</div>
			<div class="messagetents">
				8.2保证融资项目真实、合法，并按照约定用途使用借贷资金。
			</div>
			<div class="messagetents">
				8.3确保自身具有与借款金额相匹配的还款能力并按照《借款合同》约定还款。
			</div>
			<div class="messagetents">
				8.5 本协议、《借款合同》及有关协议约定的其他权利义务。
			</div>
			<div class="messagetitlbox">九、平台的权利义务</div>
			<div class="messagetents">
				9.1全民金服根据您提供的信息以及全民金服根据您的授权自行搜集的信息和资料进行审核并针对您提供的信息和资料对您的还款能力、还款意愿和资产状况进行评估、分析，基于此等评估、分析，不时确定、更新您可以通过全民金服的推荐、撮合服务获得的借款额度。您在此不可撤销地同意并授权，全民金服可以将本条款项下的事项委托第三方处理
			</div>
			<div class="messagetents">
				9.2借贷交易管理在您与出借人通过本平台签署《借款协议》等相关法律文件达成借贷交易后，全民金服将对您与出借人之间的借贷交易提供持续的管理，包括但不限于还款提醒、催收、信用跟踪评审等。
			</div>
			<div class="messagetents">
				9.3全民金服有权根据自己的合理判断决定借款人是否合法使用全民金服、是否违反全民金服的各类规则以及随时验证该借款相关的出借人和借款人，若有确认存在任何不合法合规的情况全民金服可以根据情况中止或终止该借款标的。
			</div>
			<div class="messagetents">
				9.4 本协议、《借款合同》及有关协议约定的其他权利义务。
			</div>
			<div class="messagetitlbox">十、法律适用与争议解决</div>
			<div class="messagetents">
				10.1本协议之效力、解释、变更、履行与争议解决均适用中华人民共和国法律。
			</div>
			<div class="messagetents">
				10.2因本协议产生之任何争议，由当事人友好协商解决；协商不成的，任何一方均有权向全民金服注册地的广西壮族自治区南宁市青秀区人民法院提起诉讼。
			</div>
			<div class="messagetitlbox">十 一、其他</div>
			<div class="messagetents">
				11.1本协议经借款人通过全民金服以在线点击确认或点击相关按钮的方式订立并生效，以借款人账户在全民金服通过点击确认或类似方式签署本电子协议即视为借款人本人操作且系借款人本人真实意愿签署本协议，亦将被视为本协议的签署行为。本协议自生效之日起，除非全民金服终止本协议或者出借人丧失本平台用户资格，否则本协议始终有效。本协议终止并不免除借款人根据本协议或其他有关协议、规则所应承担的义务和责任。
			</div>
			<div class="messagetents">
				11.2全民金服有权对本协议、《注册服务协议》、《借款合同》、《出借人服务协议》及其他全民金服的各类规则进行修改，经修改的协议、规则一经在全民金服公布后，立即自动生效。
			</div>
			<div class="messagetents">
				11.3若本协议的部分条款被认定为无效或者无法实施时，本协议中的其他条款仍然有效并应继续予以履行。
			</div>
			
		</div>
	</div>
</template>

<script>
export default {
  data() {
    return {
      moves: 2
    };
  },
  methods: {
    movesone() {
      this.moves = 1;
    },
    movestwo() {
      this.moves = 2;
	},
	movesthree(){
	  this.moves=3
	}
  },
  mounted() {
    var set = setInterval(() => {
      if (this.$route.name == "messagethree") {
        var h = $(".messagefour").height();
        var hs = h + 190 + 400;
        $("html").height(hs);
        $("body").height(hs);
      } else {
        clearInterval(set);
      }
    }, 100);
  }
};
</script>

<style scoped="scoped">
.messagefour {
  width: 100%;
  background-color: #ffffff;
  border-top: 1px solid #ffffff;
  /*overflow:hidden;*/
  position: relative;
}
.messageonediv {
  width: 940px;
  margin: auto;
  margin-top: 20px;
  font-size: 16px;
  height: 30px;
  border-bottom: 1px dashed #cacaca;
}
.messageonediv_divone {
  float: left;
  width: 100px;
  height: 30px;
  line-height: 28px;
  cursor: pointer;
  text-align: center;
  border: 1px solid #fd8f00;
  color: #fd8f00;
  box-sizing: border-box;
}
.messageonediv_div {
  border: none;
  background: #fd8f00;
  color: #ffffff;
  cursor: pointer;
  text-align: center;
}
.messageonebox {
  width: 940px;
  margin: auto;
  margin-top: 40px;
  padding-bottom: 60px;
}
.headline {
  font-size: 18px;
  font-weight: bold;
  /*text-indent: 10px;*/
}
.headlinebox {
  font-size: 17px;
  /*font-weight: bold;*/
  text-indent: 20px;
  margin-top: 40px;
}
.textfont {
  font-weight: 17px;
  font-weight: bold;
  text-indent: 10px;
  margin-top: 20px;
  margin-bottom: 10px;
}
.textbottoms {
  font-size: 16px;
  text-indent: 20px;
  margin-bottom: 30px;
}
.messageonetitle {
  width: 100%;
  font-size: 20px;
  font-weight: bold;
  text-align: center;
}
.messagetitlbox {
  font-size: 18px;
  font-weight: bold;
  margin-top: 20px;
}
.messagetitlboxli {
  font-size: 16px;
  font-weight: bold;
  margin-top: 10px;
  text-indent: 40px;
}
.messagetents {
  font-size: 16px;
  margin-top: 10px;
  text-indent: 40px;
}
</style>